Merge pull request #5 from smbox/dev
Updated Process Flow
